// 1.- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time=33;
// if (time>0 && time<15){
//     console.log('1');
// }else if(time >15 && time<30){
//     console.log('2');
// }else if(time>30 && time<45){
//     console.log('3');
// } else if (time>45 && time<60){
//     console.log('4');
// }
//2.- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let dayMonth=1;
// if (dayMonth>=1 && dayMonth<=10){
//     console.log('First');
// }else if(dayMonth>10 && dayMonth<=20){
//     console.log('Second');
// }else if(dayMonth>20 && dayMonth<=31){
//     console.log('Threed')
//}
//3. У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test=(true);
//     if (test===true){
//         console.log('Вірно!')
//     }else {
//         console.log('Неправильно!')
//     }
//4.Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a=2;
// if (a===0){
//     console.log('Correct');
// }else{
//     console.log('Not correct');
//}
//5.Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let studying=12;
// if (studying>=10 && studying<=22){
//     console.log('go learn');
// }else {
//     console.log('stay Online');
//}
//6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
// let allPresents=prompt('Which your number?')
// switch (allPresents){
//     case '1':
//         alert('Car')
//         break;
//     case '2':
//         alert('Moto')
//         break;
//     case '3':
//         alert('Phone')
//         break;
//     case '4':
//         alert('Chocolate')
//         break;
//     case '5':
//         alert('Watch')
//         break;
// }
